#include <stdio.h>
#include <stdlib.h>

//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
//嫌疑犯的一个。以下为4个嫌疑犯的供词。
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手。


int main() {

	int arr[4] = { 0 };
	   // arr[0] => A     0 代表他们无罪 
	   // arr[1] => B     1 代表他们们有罪
	   // arr[2] => C
	   // arr[3] => D

	for (int i = 0; i < 4; i++) {
		//要从A开始遍历情况

		arr[i] = 1;//假设这个人有罪

		if ((arr[0] != 1) + (arr[2] == 1) +
			(arr[3] == 1) + (arr[3] != 1) == 3) {
			printf("%c是凶手!\n", 'A' + i);
			//'A' + i 即为对应大写字母的ASCII码
		}

		arr[i] = 0; //假设后还给他清白 
	}


	system("pause");
	return 0;
}